openFOAM/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{

    AortaOutlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    AortaInlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    AortaWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
