openFOAM/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
69941
(
-1.48608e-06
-7.49442e-07
-1.55305e-05
-1.04645e-06
7.06977e-08
-6.94039e-07
1.90795e-07
1.9245e-05
...
)
;

boundaryField
{
    AortaInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
82
(
-3.66361e-06
-1.54233e-06
-2.98383e-06
-3.84692e-06
-2.98312e-06
-5.12602e-07
-3.09566e-06
-2.98525e-06
...
)
;
    }
    AortaOutlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
62
(
5.23224e-06
2.5379e-06
2.20145e-06
1.77723e-05
3.18834e-06
2.62528e-06
4.03194e-06
4.77038e-06
...
)
;
    }
    AortaWall
    {
        type            calculated;
        value           uniform -0;
    }
}


// ************************************************************************* //
