openFOAM/0/thicknessFraction
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thicknessFraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    defaultFaces
    {
        type            empty;
    }
    AortaInlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
82
(
0
0
0
0
0
0
0
0
...
)
;
    }
    AortaOutlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
62
(
0
0
0
0
0
0
0
0
...
)
;
    }
    AortaWall
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
6739
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
